{
  "project_name": "MedSync Front",
  "description": "Sistema de gestão médica - Frontend",
  "tech_stack": [
    "Next.js 16",
    "React 19",
    "TypeScript",
    "Tailwind CSS 4",
    "Supabase",
    "React Hook Form",
    "Zod",
    "Radix UI",
    "shadcn/ui",
    "Lucide React",
    "Recharts",
    "date-fns",
    "next-themes",
    "jsPDF",
    "html2canvas",
    "Sonner"
  ],
  "features": [
    {
      "id": "F001",
      "title": "Create address database schema and migration",
      "type": "feature",
      "description": "Expand Supabase database schema to include comprehensive address fields for clinics/hospitals. Create new table 'facility_addresses' with fields: facility_id (FK), street, number, complement, neighborhood, city, state, postal_code, country, latitude, longitude, created_at, updated_at. Add foreign key relationship to facilities table. Create and apply migration.",
      "acceptance_criteria": [
        "facility_addresses table created with all required fields",
        "Foreign key relationship established with facilities table",
        "Migration file created and successfully applied to Supabase",
        "Latitude and longitude fields configured as numeric types",
        "Indexes created for facility_id and location queries"
      ],
      "passes": true
    },
    {
      "id": "F002",
      "title": "Create address Zod validation schema",
      "type": "feature",
      "description": "Create comprehensive Zod validation schema for facility addresses in schemas/facility-address.schema.ts. Include validation for all address fields with Brazilian address patterns (CEP format, state abbreviations). Add optional latitude/longitude validation. Export schema types for TypeScript usage throughout the application.",
      "acceptance_criteria": [
        "Zod schema created in schemas/facility-address.schema.ts",
        "CEP validation implemented with regex pattern (XXXXX-XXX)",
        "Brazilian state abbreviations validated against enum",
        "Latitude/longitude validated as optional numeric values within valid ranges",
        "TypeScript types exported for use in forms and API"
      ],
      "passes": true
    },
    {
      "id": "F003",
      "title": "Implement facility address API endpoints",
      "type": "feature",
      "description": "Create API routes for facility address CRUD operations. Implement POST /api/facilities/[id]/address, PATCH /api/facilities/[id]/address, and GET /api/facilities/[id]/address. Add Zod validation, error handling, and Supabase integration. Include RLS policies for organization-level access control.",
      "acceptance_criteria": [
        "API routes created for POST, PATCH, and GET operations",
        "Zod schema validation applied to all request bodies",
        "Supabase queries implemented with proper error handling",
        "RLS policies configured for organization-level data isolation",
        "Appropriate HTTP status codes returned for all scenarios"
      ],
      "passes": true
    },
    {
      "id": "F004",
      "title": "Install and configure Leaflet.js for maps",
      "type": "feature",
      "description": "Install react-leaflet and leaflet packages. Configure Leaflet CSS imports in globals.css. Create TypeScript type declarations for Leaflet if needed. Set up basic map configuration with default center coordinates (Brazil center). Create base MapContainer wrapper component in components/molecules with proper Next.js dynamic import to avoid SSR issues.",
      "acceptance_criteria": [
        "react-leaflet and leaflet packages installed via npm",
        "Leaflet CSS imported and styled correctly in globals.css",
        "MapContainer wrapper component created with dynamic import",
        "Default map configuration set to Brazil's geographic center",
        "Component renders correctly without SSR hydration errors"
      ],
      "passes": true
    },
    {
      "id": "F005",
      "title": "Create AddressFormFields component with all address inputs",
      "type": "feature",
      "description": "Build comprehensive AddressFormFields component in components/molecules using React Hook Form integration. Include inputs for street, number, complement, neighborhood, city, state (dropdown), postal_code (with mask), and country. Implement CEP auto-complete using ViaCEP API. Apply Zod validation schema. Follow existing form patterns in the project.",
      "acceptance_criteria": [
        "AddressFormFields component created with all required input fields",
        "React Hook Form integration implemented with proper typing",
        "Brazilian state dropdown populated with all 27 states",
        "CEP input mask applied (XXXXX-XXX format)",
        "ViaCEP API integration auto-fills address fields on valid CEP"
      ],
      "passes": true
    },
    {
      "id": "F006",
      "title": "Create interactive LocationPicker map component",
      "type": "feature",
      "description": "Build LocationPicker component in components/molecules using Leaflet.js. Implement click-to-place marker functionality to set latitude/longitude. Add drag marker feature to adjust location. Include search box for address lookup with geocoding. Display current coordinates. Integrate with React Hook Form to update latitude/longitude fields. Add responsive design for mobile devices.",
      "acceptance_criteria": [
        "LocationPicker component created with Leaflet map integration",
        "Click-to-place marker functionality working correctly",
        "Marker dragging updates latitude/longitude in real-time",
        "Geocoding search box implemented for address lookup",
        "Component integrates with React Hook Form setValue/watch"
      ],
      "passes": true
    },
    {
      "id": "F007",
      "title": "Integrate address form into facility creation flow",
      "type": "feature",
      "description": "Update facility creation form to include AddressFormFields and LocationPicker components. Modify facility.schema.ts to include address validation. Update form submission logic to save address data via API. Ensure proper form state management and error handling. Add loading states during address save operations.",
      "acceptance_criteria": [
        "AddressFormFields component integrated into facility creation form",
        "LocationPicker component added with proper spacing and layout",
        "Form submission saves complete address data including geolocation",
        "Error messages displayed for address validation failures",
        "Loading states shown during API calls"
      ],
      "passes": true
    },
    {
      "id": "F008",
      "title": "Integrate address form into facility edit flow",
      "type": "feature",
      "description": "Update facility edit form to load existing address data and populate AddressFormFields and LocationPicker. Implement PATCH API call to update address. Handle cases where facility has no existing address (create new). Pre-populate map marker with existing latitude/longitude. Add confirmation for location changes.",
      "acceptance_criteria": [
        "Existing address data loaded and populated in form fields",
        "Map marker positioned at existing coordinates on load",
        "PATCH API updates address when editing existing facility",
        "New address created if facility has no existing address",
        "All form fields editable with proper validation"
      ],
      "passes": true
    },
    {
      "id": "F009",
      "title": "Create facility location display component for read-only views",
      "type": "feature",
      "description": "Build FacilityLocationDisplay component in components/molecules to show complete address and map in read-only mode. Display formatted address with all fields. Show static Leaflet map with marker at facility location. Add 'Open in Google Maps' link. Use in facility detail views and lists. Implement responsive design.",
      "acceptance_criteria": [
        "FacilityLocationDisplay component created for read-only views",
        "Complete address displayed in formatted, readable layout",
        "Static map rendered with marker at correct coordinates",
        "Google Maps link opens facility location in new tab",
        "Component responsive on mobile and desktop devices"
      ],
      "passes": true
    },
    {
      "id": "F010",
      "title": "Add migration to populate existing facilities with default address",
      "type": "feature",
      "description": "Create data migration script to handle existing facilities with old text-based address field. Parse existing address text into structured format where possible. Create facility_addresses records for all existing facilities. Add flag to indicate auto-migrated vs user-entered addresses. Log migration results and handle edge cases.",
      "acceptance_criteria": [
        "Migration script created to process existing facilities",
        "Old text address field parsed and mapped to new structure",
        "facility_addresses records created for all existing facilities",
        "Migration logs created showing success/failure counts",
        "Edge cases handled gracefully with fallback values"
      ],
      "passes": true
    },
    {
      "id": "F011",
      "title": "Create Supabase RPC function for dashboard report metrics",
      "type": "feature",
      "description": "Create PostgreSQL function 'reports_dashboard_metrics' that aggregates real data from shifts, medical_staff, facilities, and payment_records tables. Function should accept parameters: p_period (text), p_specialty (text), p_unit (text/uuid). Return structure must match ReportMetricsBundle interface with summary metrics, specialty trends, efficiency trends, financial trends, and highlights based on actual database data.",
      "acceptance_criteria": [
        "PostgreSQL function reports_dashboard_metrics created with correct signature",
        "Function queries shifts table grouped by date for trend data",
        "Function calculates attendance volume from shifts by specialty",
        "Function calculates financial metrics from payment_records table",
        "Function returns JSON structure matching ReportMetricsBundle TypeScript interface"
      ],
      "passes": true
    },
    {
      "id": "F012",
      "title": "Implement specialty-based filtering in report metrics",
      "type": "feature",
      "description": "Extend reports_dashboard_metrics RPC function to filter data by medical staff specialty. Query medical_staff table to filter shifts by staff specialty field. Handle 'todas' (all) option to return aggregated data across all specialties. Ensure specialty trend chart data is correctly filtered and grouped.",
      "acceptance_criteria": [
        "RPC function filters shifts by medical_staff.specialty when p_specialty != 'todas'",
        "Specialty parameter properly joins shifts with medical_staff table",
        "Returns aggregated data for all specialties when p_specialty = 'todas'",
        "Specialty trend data correctly reflects filtered results",
        "Handles NULL specialty values gracefully"
      ],
      "passes": true
    },
    {
      "id": "F013",
      "title": "Implement facility-based filtering in report metrics",
      "type": "feature",
      "description": "Extend reports_dashboard_metrics RPC function to filter data by facility (unit). Query facilities table and filter shifts by facility_id. Handle 'todas' (all) option to return data across all facilities. Update highlights section to show top performers filtered by selected facility.",
      "acceptance_criteria": [
        "RPC function filters shifts by facility_id when p_unit != 'todas'",
        "Facility parameter properly joins shifts with facilities table",
        "Returns aggregated data for all facilities when p_unit = 'todas'",
        "Highlights data reflects facility filtering",
        "Validates facility_id exists in facilities table"
      ],
      "passes": true
    },
    {
      "id": "F014",
      "title": "Calculate real summary metrics from database",
      "type": "feature",
      "description": "Implement summary metrics calculation in reports_dashboard_metrics function: total attendances from shifts count, average occupancy rate from shift_attendance, revenue from payment_records.total_amount sum, denial rate from payment_records. Calculate period-over-period deltas comparing current period with previous period of same length.",
      "acceptance_criteria": [
        "Total attendances calculated from shifts table count for period",
        "Occupancy rate calculated from shift_attendance check-in/check-out data",
        "Revenue sum calculated from payment_records.total_amount",
        "Denial/glosa rate calculated from payment_records metadata or status",
        "Delta percentages calculated comparing current vs previous period"
      ],
      "passes": true
    },
    {
      "id": "F015",
      "title": "Generate specialty trend time series from shifts data",
      "type": "feature",
      "description": "Implement specialty trend chart data generation in RPC function. Query shifts joined with medical_staff, group by date and specialty. Generate time series data points with labels and counts for each specialty (geral, cardiologia, pediatria, etc). Handle dynamic date range based on period parameter (7d, 30d, 90d, 180d).",
      "acceptance_criteria": [
        "Shifts grouped by date using date_trunc based on period length",
        "Data joined with medical_staff to get specialty field",
        "Returns array of points with label and count per specialty",
        "Handles all period options: 7d, 30d, 90d, 180d correctly",
        "Date labels formatted appropriately for chart display"
      ],
      "passes": true
    },
    {
      "id": "F016",
      "title": "Generate financial trend from payment records",
      "type": "feature",
      "description": "Implement financial trend calculation in RPC function. Query payment_records table grouped by date, calculate total revenue (sum of total_amount) and glosas/denials. Generate time series matching period parameter. Include weekend_bonus, night_shift_bonus, and holiday_bonus in revenue calculations.",
      "acceptance_criteria": [
        "Payment records grouped by date with proper date_trunc",
        "Revenue calculated as sum of payment_records.total_amount",
        "Glosas/denials extracted from payment metadata or calculated",
        "Returns array with label, receita, and glosas fields",
        "Handles cases where no payment records exist for dates"
      ],
      "passes": true
    },
    {
      "id": "F017",
      "title": "Calculate efficiency metrics from attendance data",
      "type": "feature",
      "description": "Implement efficiency trend calculation in RPC function. Calculate occupancy rate from shift_attendance table (filled shifts / total shifts * 100). Calculate average SLA/wait time from shift timing data. Group by date to create time series for period. Handle cases where shift_attendance data is sparse.",
      "acceptance_criteria": [
        "Occupancy calculated as (shifts with attendance / total shifts) * 100",
        "SLA calculated from average shift start delay or attendance metrics",
        "Returns time series with label, ocupacao, and sla fields",
        "Handles missing shift_attendance records gracefully",
        "Groups data by appropriate date intervals based on period"
      ],
      "passes": true
    },
    {
      "id": "F018",
      "title": "Generate top performers highlights from real data",
      "type": "feature",
      "description": "Implement highlights calculation in RPC function to show top performing medical staff. Query shifts joined with medical_staff and facilities, count shifts per staff member in period, calculate period-over-period variation. Return top 3-5 performers with name, specialty, unit, volume, and variation percentage.",
      "acceptance_criteria": [
        "Query returns top 3-5 medical staff by shift count in period",
        "Joins with medical_staff for name and specialty",
        "Joins with facilities for unit/facility name",
        "Calculates variation comparing to previous period",
        "Returns structure matching HighlightRow interface"
      ],
      "passes": true
    },
    {
      "id": "F019",
      "title": "Update ReportFilters with dynamic facility and specialty options",
      "type": "feature",
      "description": "Create API endpoint /api/reports/filter-options that queries Supabase for distinct facilities and medical staff specialties. Update ReportFilters component to fetch and populate dropdown options dynamically. Replace hardcoded filter options with real data from database.",
      "acceptance_criteria": [
        "API route /api/reports/filter-options created",
        "Endpoint queries facilities table for active facilities",
        "Endpoint queries medical_staff for distinct specialties",
        "ReportFilters component fetches options on mount",
        "Dropdowns populated with real facility names and specialties"
      ],
      "passes": true
    },
    {
      "id": "F020",
      "title": "Add organization-based RLS and filtering to reports",
      "type": "feature",
      "description": "Implement organization context filtering in reports. Update reports_dashboard_metrics to accept organization_id parameter. Apply RLS policies to ensure users only see data for their organization. Update frontend to pass current organization_id from OrganizationProvider context to API calls.",
      "acceptance_criteria": [
        "RPC function accepts p_organization_id parameter",
        "All queries filtered by organization_id from shifts, facilities, medical_staff",
        "Frontend passes organization_id from OrganizationProvider",
        "RLS policies verified for all queried tables",
        "Users cannot access reports from other organizations"
      ],
      "passes": true
    }
  ]
}