{
  "project_name": "medsync",
  "description": "Projeto app mobile e web para gerenciamento de escalas médicas",
  "tech_stack": [
    "TypeScript",
    "React",
    "Supabase",
    "React Hook Form",
    "Zod",
    "date-fns",
    "Next.js 16",
    "Tailwind CSS 4",
    "shadcn/ui",
    "Radix UI",
    "TanStack React Query",
    "Recharts",
    "Leaflet",
    "React Big Calendar",
    "Lucide React",
    "next-themes",
    "React Native",
    "Expo SDK 54",
    "Expo Router",
    "React Navigation",
    "React Native Reanimated",
    "React Native Calendars",
    "Lottie",
    "Expo Image Picker",
    "Expo Notifications",
    "Expo Secure Store"
  ],
  "features": [
    {
      "id": "F001",
      "title": "Create especialidades table in Supabase with seed data",
      "type": "refactoring",
      "description": "Create new 'especialidades' table in Supabase with columns: id (uuid, primary key), nome (text, unique, not null), created_at (timestamp). Create migration file that includes table creation, RLS policies for public read access, and seed data with common medical specialties (Cardiologia, Dermatologia, Ortopedia, Pediatria, Ginecologia, Oftalmologia, etc.). Enable RLS and set appropriate permissions.",
      "acceptance_criteria": [
        "Migration file created in migrations/ directory",
        "Table 'especialidades' created with id, nome, created_at columns",
        "RLS enabled with policy allowing public SELECT access",
        "At least 15 common medical specialties seeded in the table",
        "Migration executed successfully in Supabase"
      ],
      "passes": true
    },
    {
      "id": "F002",
      "title": "Analyze and migrate existing corpo_clinico specialty data",
      "type": "refactoring",
      "description": "Query existing corpo_clinico table to extract all unique specialty values from the string field. Analyze the data to identify duplicates, variations, and typos. Create data migration script that: 1) maps existing string values to especialidades table IDs, 2) adds new column 'especialidade_id' (uuid, foreign key to especialidades) to corpo_clinico, 3) populates especialidade_id based on string matching, 4) handles edge cases and unmapped values by creating new entries in especialidades table.",
      "acceptance_criteria": [
        "Data analysis script created that lists all unique specialty values",
        "Migration script handles string-to-ID mapping with fuzzy matching for typos",
        "New column 'especialidade_id' added to corpo_clinico with foreign key constraint",
        "All existing records successfully migrated to use especialidade_id",
        "Migration script logs any unmapped or ambiguous values for manual review"
      ],
      "passes": true
    },
    {
      "id": "F003",
      "title": "Update TypeScript types and Zod schemas for especialidade refactor",
      "type": "refactoring",
      "description": "Update shared TypeScript types in packages/shared/src to include Especialidade type with id and nome fields. Update CorpoClinico type to change especialidade from string to especialidade_id (uuid) and add nested especialidade object. Create Zod schemas for especialidade validation. Update form schemas in both web and mobile apps to validate especialidade_id instead of free text. Generate TypeScript types from Supabase schema using supabase gen types.",
      "acceptance_criteria": [
        "Especialidade type defined in packages/shared/src/types",
        "CorpoClinico type updated with especialidade_id and nested especialidade",
        "Zod schemas created for especialidade validation",
        "Form schemas in web and mobile updated to use especialidade_id",
        "TypeScript types generated from updated Supabase schema"
      ],
      "passes": true
    },
    {
      "id": "F004",
      "title": "Create useEspecialidades hook with React Query",
      "type": "refactoring",
      "description": "Create shared hook useEspecialidades in packages/shared/src/hooks that fetches especialidades from Supabase using React Query. Implement caching with staleTime of 1 hour (data rarely changes). Include error handling, loading states, and retry logic. Export hook for use in both web and mobile apps. Add optional search/filter functionality to find especialidades by name.",
      "acceptance_criteria": [
        "useEspecialidades hook created in packages/shared/src/hooks",
        "React Query used with appropriate caching configuration (staleTime: 1 hour)",
        "Hook returns { data, isLoading, error, refetch } interface",
        "Error handling and retry logic implemented",
        "Optional search parameter implemented for filtering by name"
      ],
      "passes": true
    },
    {
      "id": "F005",
      "title": "Refactor web app corpo clinico forms to use Select component",
      "type": "refactoring",
      "description": "Update corpo clinico create/edit forms in apps/web to replace text input with shadcn/ui Select component. Integrate useEspecialidades hook to populate Select options. Update React Hook Form field from 'especialidade' string to 'especialidade_id' uuid. Implement search/filter functionality in Select for better UX with many options. Ensure proper validation and error messages. Update form submission to send especialidade_id to API.",
      "acceptance_criteria": [
        "Text input replaced with shadcn/ui Select component in create form",
        "Text input replaced with shadcn/ui Select component in edit form",
        "useEspecialidades hook integrated to fetch and populate options",
        "Select component includes search/filter functionality",
        "Form validation updated to require especialidade_id selection",
        "Form submission successfully sends especialidade_id to backend"
      ],
      "passes": true
    },
    {
      "id": "F006",
      "title": "Refactor mobile app corpo clinico forms to use Picker component",
      "type": "refactoring",
      "description": "Update corpo clinico create/edit screens in apps/mobile to replace TextInput with React Native Picker or custom dropdown component. Integrate useEspecialidades hook to populate Picker options. Update form field from 'especialidade' string to 'especialidade_id' uuid. Implement platform-appropriate UI (iOS action sheet, Android dropdown). Ensure proper validation and error messages. Update form submission to send especialidade_id.",
      "acceptance_criteria": [
        "TextInput replaced with appropriate Picker/dropdown in create screen",
        "TextInput replaced with appropriate Picker/dropdown in edit screen",
        "useEspecialidades hook integrated to fetch and populate options",
        "Platform-appropriate UI implemented (iOS/Android)",
        "Form validation updated to require especialidade_id selection",
        "Form submission successfully sends especialidade_id to backend"
      ],
      "passes": true
    },
    {
      "id": "F007",
      "title": "Update all display views to show especialidade.nome via join",
      "type": "refactoring",
      "description": "Update all Supabase queries that fetch corpo_clinico records to include .select('*, especialidade:especialidade_id(id, nome)') to join especialidades table. Update display components in both web (tables, cards, detail views) and mobile (lists, cards, profile screens) to render especialidade.nome instead of string field. Handle null/undefined cases gracefully with fallback text. Ensure no breaking changes in existing views.",
      "acceptance_criteria": [
        "All corpo_clinico queries updated to join especialidades table",
        "Web app tables/lists display especialidade.nome correctly",
        "Web app detail/profile views display especialidade.nome correctly",
        "Mobile app lists/cards display especialidade.nome correctly",
        "Mobile app detail/profile screens display especialidade.nome correctly",
        "Null/undefined especialidade handled with appropriate fallback (e.g., 'Não especificado')"
      ],
      "passes": true
    },
    {
      "id": "F008",
      "title": "Remove deprecated especialidade string column and update tests",
      "type": "refactoring",
      "description": "After verifying all functionality works with especialidade_id: Create migration to drop old 'especialidade' string column from corpo_clinico table. Remove any remaining references to the old field in codebase. Update or create unit/integration tests for forms, queries, and display components to verify especialidade selection and display. Test edge cases like missing especialidades, form validation, and data migration scenarios. Document the refactoring in README or migration notes.",
      "acceptance_criteria": [
        "Migration created to safely drop 'especialidade' string column",
        "All code references to old especialidade string field removed",
        "Unit tests created/updated for web forms with especialidade Select",
        "Unit tests created/updated for mobile forms with especialidade Picker",
        "Integration tests verify correct data flow from selection to display",
        "Documentation updated explaining the especialidade refactoring"
      ],
      "passes": true
    },
    {
      "id": "F009",
      "title": "Investigate and document Calendário de Escalas current implementation",
      "type": "feature",
      "description": "Analyze the current calendar component implementation to understand the filter functionality issues. Document the component structure, identify which filters are broken (Hoje/Anterior/Próximo navigation, dezembro 2025 month selector, Mês/Semana/Dia/Agenda view switcher), locate the relevant files in the project structure, and identify the root causes of the filtering issues. Create a technical summary of findings.",
      "acceptance_criteria": [
        "Calendar component files located and documented",
        "All broken filter functionalities identified and catalogued",
        "Root causes of filter issues documented",
        "Current state vs expected behavior clearly described",
        "Technical summary created with fix recommendations"
      ],
      "passes": true
    },
    {
      "id": "F010",
      "title": "Fix Hoje/Anterior/Próximo date navigation controls",
      "type": "feature",
      "description": "Repair the date navigation controls that allow users to jump to today, previous period, or next period in the calendar. Ensure proper state management for current date selection, implement correct date calculation logic using date-fns, and verify navigation works correctly across all view modes (Mês/Semana/Dia/Agenda). Add proper event handlers and state updates.",
      "acceptance_criteria": [
        "Hoje button correctly navigates to current date",
        "Anterior button moves to previous period based on current view",
        "Próximo button moves to next period based on current view",
        "Date state properly updates and reflects in calendar UI",
        "Navigation works correctly in all view modes"
      ],
      "passes": true
    },
    {
      "id": "F011",
      "title": "Fix month/year selector (dezembro 2025) functionality",
      "type": "feature",
      "description": "Repair the month and year selection controls that allow users to pick specific months and years. Implement proper onChange handlers, ensure state synchronization between selector and calendar display, add proper date validation, and verify the calendar correctly renders events for the selected month/year. Use date-fns for date manipulation.",
      "acceptance_criteria": [
        "Month selector dropdown functions correctly",
        "Year selector dropdown functions correctly",
        "Selected month/year properly updates calendar display",
        "Calendar events load correctly for selected period",
        "Date state remains consistent across component"
      ],
      "passes": true
    },
    {
      "id": "F012",
      "title": "Fix view mode switcher (Mês/Semana/Dia/Agenda)",
      "type": "feature",
      "description": "Repair the view mode toggle controls that switch between Month, Week, Day, and Agenda views. Implement proper view state management, ensure each view mode renders correctly with appropriate layout and event display, handle date range calculations for each view type, and maintain selected date when switching between views. Utilize React Big Calendar or custom view components.",
      "acceptance_criteria": [
        "Mês (Month) view renders correctly with all dates",
        "Semana (Week) view shows correct 7-day range",
        "Dia (Day) view displays single day with hourly breakdown",
        "Agenda view shows list of upcoming events",
        "View switching maintains current date selection"
      ],
      "passes": true
    },
    {
      "id": "F013",
      "title": "Integrate all calendar filters and verify complete functionality",
      "type": "feature",
      "description": "Ensure all calendar filters work together harmoniously. Test interactions between date navigation, month/year selector, and view mode switcher. Verify state management is consistent across all filter types, fix any race conditions or state conflicts, ensure URL parameters or local state persist user selections, and validate calendar performance with multiple filters active.",
      "acceptance_criteria": [
        "All filters work together without conflicts",
        "Changing one filter doesn't break others",
        "Calendar state persists correctly during filter changes",
        "No console errors or warnings during filter usage",
        "Calendar renders correctly with any filter combination"
      ],
      "passes": true
    },
    {
      "id": "F014",
      "title": "Create Playwright e2e test setup with authentication",
      "type": "feature",
      "description": "Set up Playwright testing framework for the web application. Configure Playwright with proper TypeScript support, create authentication helper that logs in with provided credentials (ths.pereira@gmail.com / Qsesbs2006), implement session storage to avoid repeated logins, create base test fixtures and page objects for calendar testing, and configure test environment variables.",
      "acceptance_criteria": [
        "Playwright installed and configured in apps/web",
        "Authentication helper successfully logs in test user",
        "Session state is reused across tests",
        "Base fixtures and page objects created for calendar",
        "Test configuration file created with proper settings"
      ],
      "passes": true
    },
    {
      "id": "F015",
      "title": "Write e2e tests for date navigation controls",
      "type": "feature",
      "description": "Create comprehensive Playwright e2e tests for Hoje/Anterior/Próximo navigation controls. Test clicking Hoje button navigates to current date, test Anterior/Próximo buttons navigate correctly in each view mode, verify date display updates correctly, test edge cases like month/year boundaries, and ensure tests run reliably with proper waits and assertions.",
      "acceptance_criteria": [
        "Test suite covers Hoje button navigation",
        "Test suite covers Anterior button in all views",
        "Test suite covers Próximo button in all views",
        "Edge cases tested (month boundaries, year transitions)",
        "All tests pass consistently with proper assertions"
      ],
      "passes": true
    },
    {
      "id": "F016",
      "title": "Write e2e tests for month/year selector and view modes",
      "type": "feature",
      "description": "Create comprehensive Playwright e2e tests for month/year selection and view mode switching. Test selecting different months and years updates calendar correctly, test switching between Mês/Semana/Dia/Agenda views, verify events display correctly in each view, test combined filter scenarios, and ensure all tests have proper assertions and error handling.",
      "acceptance_criteria": [
        "Tests verify month selector functionality",
        "Tests verify year selector functionality",
        "Tests verify all 4 view modes render correctly",
        "Tests verify events display in each view mode",
        "Combined filter scenarios tested successfully"
      ],
      "passes": true
    },
    {
      "id": "F017",
      "title": "Add calendar e2e tests to CI/CD and document test usage",
      "type": "feature",
      "description": "Integrate Playwright calendar tests into the project's CI/CD pipeline. Update package.json with test scripts, configure test running in GitHub Actions or similar CI, create test documentation explaining how to run tests locally and in CI, document the test user credentials management approach, and ensure tests run in headless mode for CI while supporting headed mode for debugging.",
      "acceptance_criteria": [
        "Test scripts added to package.json (test:e2e, test:e2e:ui)",
        "CI/CD pipeline configured to run calendar tests",
        "README or docs updated with test running instructions",
        "Test credentials securely managed (env vars/secrets)",
        "Tests successfully run in both local and CI environments"
      ],
      "passes": true
    },
    {
      "id": "F018",
      "type": "feature",
      "title": "Create reusable DataTable component architecture with Atomic Design",
      "description": "Design and implement a reusable DataTable component system following Atomic Design principles. Create atoms (TableCell, TableHeader, TableRow), molecules (TablePagination, TableToolbar, ColumnHeader), and organisms (DataTable). Set up folder structure in src/components/data-table/ with proper TypeScript types and TanStack Table integration. Include base configuration for sorting, filtering, and pagination.",
      "acceptance_criteria": [
        "Atomic Design folder structure created in src/components/data-table/",
        "Base atoms created: TableCell, TableHeader, TableRow components",
        "Molecules created: TablePagination, TableToolbar, ColumnHeader with sort indicators",
        "DataTable organism created with TanStack Table integration",
        "TypeScript types defined for generic table data and column configuration"
      ],
      "passes": true
    },
    {
      "id": "F019",
      "type": "feature",
      "title": "Install TanStack Table and configure core table utilities",
      "description": "Install @tanstack/react-table package and create utility functions for table configuration. Implement helpers for column definitions, sorting state, filtering logic, and pagination handlers. Create useDataTable custom hook to encapsulate common table logic. Set up proper TypeScript generics for type-safe table operations.",
      "acceptance_criteria": [
        "@tanstack/react-table package installed in apps/web",
        "useDataTable hook created with TypeScript generics support",
        "Utility functions created for column helpers and table state management",
        "Default table configuration exported for reuse across tables",
        "Documentation added for hook usage and table configuration"
      ],
      "passes": true
    },
    {
      "id": "F020",
      "type": "feature",
      "title": "Refactor Clínicas table to use TanStack Table with DataTable components",
      "description": "Migrate the existing clinicas table at /dashboard/organizacao/clinicas to use the new DataTable component system. Define column configurations for clinic data (name, address, phone, status). Implement sorting, filtering by name/status, and pagination. Preserve existing actions (edit, delete, view). Integrate with existing React Query hooks for clinicas data.",
      "acceptance_criteria": [
        "Clínicas page refactored to use DataTable component",
        "Column definitions created for all clinic fields",
        "Sorting implemented for name, created date columns",
        "Search/filter functionality working for clinic name and status",
        "Pagination working with configurable page sizes (10, 25, 50, 100)"
      ],
      "passes": true
    },
    {
      "id": "F021",
      "type": "feature",
      "title": "Refactor Equipe table to use TanStack Table with DataTable components",
      "description": "Migrate the existing equipe table at /dashboard/equipe to use the new DataTable component system. Define column configurations for team member data (name, role, especialidade, email, phone, status). Implement sorting, filtering by role/especialidade/status, and pagination. Preserve existing actions. Integrate with React Query hooks and especialidades relationship.",
      "acceptance_criteria": [
        "Equipe page refactored to use DataTable component",
        "Column definitions created for all team member fields including especialidade",
        "Sorting implemented for name, role, especialidade columns",
        "Multi-select filters working for role, especialidade, and status",
        "Pagination working with same configurable page sizes as Clínicas"
      ],
      "passes": true
    },
    {
      "id": "F022",
      "type": "feature",
      "title": "Setup unit testing architecture with Vitest and React Testing Library",
      "description": "Configure Vitest as the unit testing framework for apps/web. Install @testing-library/react, @testing-library/jest-dom, and @testing-library/user-event. Create test setup files, configure vitest.config.ts with proper aliases and globals. Create test utilities folder with custom render functions and mock providers (QueryClient, theme). Set up test scripts in package.json.",
      "acceptance_criteria": [
        "Vitest and Testing Library packages installed",
        "vitest.config.ts created with proper TypeScript and path aliases",
        "Test setup file created with jest-dom matchers",
        "Custom render utility created with QueryClientProvider and ThemeProvider wrappers",
        "npm scripts added: test, test:watch, test:coverage"
      ],
      "passes": true
    },
    {
      "id": "F023",
      "type": "feature",
      "title": "Write unit tests for DataTable component system",
      "description": "Create comprehensive unit tests for all DataTable atoms, molecules, and organisms. Test TableCell rendering, TablePagination controls, ColumnHeader sorting, and DataTable with various configurations. Mock TanStack Table hooks. Test sorting state changes, pagination updates, and filter interactions. Achieve 80%+ code coverage for data-table components.",
      "acceptance_criteria": [
        "Unit tests created for all atoms: TableCell, TableHeader, TableRow",
        "Unit tests created for molecules: TablePagination, TableToolbar, ColumnHeader",
        "Unit tests created for DataTable organism with sorting, filtering, pagination",
        "useDataTable hook tested with various data types and configurations",
        "Code coverage above 80% for all data-table components"
      ],
      "passes": true
    },
    {
      "id": "F024",
      "type": "feature",
      "title": "Write unit tests for Clínicas and Equipe table implementations",
      "description": "Create unit tests for the refactored Clínicas and Equipe table pages. Mock Supabase queries and React Query hooks. Test column definitions, filter logic, sorting behavior, and action button interactions. Test edge cases: empty data, loading states, error states. Mock user interactions like search input, filter selection, and pagination clicks.",
      "acceptance_criteria": [
        "Unit tests created for Clínicas table page with all interactions",
        "Unit tests created for Equipe table page with especialidade integration",
        "Loading and error states tested for both tables",
        "Filter and search functionality tested with user-event simulations",
        "Action buttons (edit, delete, view) tested with proper callbacks"
      ],
      "passes": true
    },
    {
      "id": "F025",
      "type": "feature",
      "title": "Write e2e tests for Clínicas table using Playwright",
      "description": "Create Playwright e2e tests for the Clínicas table at /dashboard/organizacao/clinicas. Use existing auth.setup.ts for authentication. Test full user workflows: navigate to page, search clinics, apply filters, sort columns, paginate results, and perform CRUD actions. Test responsive behavior and accessibility. Verify data persistence after actions.",
      "acceptance_criteria": [
        "E2E test file created: e2e/clinicas-table.spec.ts",
        "Tests cover navigation, search, filtering, sorting, and pagination",
        "CRUD operations tested: create clinic, edit clinic, delete clinic",
        "Tests verify proper data display after backend mutations",
        "Tests pass consistently in CI environment"
      ],
      "passes": true
    },
    {
      "id": "F026",
      "type": "feature",
      "title": "Write e2e tests for Equipe table using Playwright",
      "description": "Create Playwright e2e tests for the Equipe table at /dashboard/equipe. Test full user workflows: navigate to page, search team members, filter by role/especialidade/status, sort columns, paginate results, and perform team member actions. Test especialidade dropdown selection. Verify integration with especialidades table. Test accessibility and keyboard navigation.",
      "acceptance_criteria": [
        "E2E test file created: e2e/equipe-table.spec.ts",
        "Tests cover navigation, search, multi-filter selection, sorting, pagination",
        "Especialidade filter tested with proper options from database",
        "Team member CRUD operations tested end-to-end",
        "Keyboard navigation and accessibility tested for table interactions"
      ],
      "passes": true
    },
    {
      "id": "F027",
      "title": "Create database schema for chat document attachments",
      "type": "feature",
      "description": "Create Supabase migration to add chat_attachments table with fields: id, conversation_id (FK), message_id (FK), sender_id, file_name, file_type (pdf/image), file_path (storage reference), file_size, status (pending/accepted/rejected), rejected_reason, reviewed_by (admin user_id), reviewed_at, created_at. Add RLS policies for staff and admin access. Configure storage bucket 'chat-documents' with appropriate policies for PDF and image uploads.",
      "acceptance_criteria": [
        "Migration creates chat_attachments table with all required fields",
        "Foreign key constraints established to chat_messages and chat_conversations",
        "Storage bucket 'chat-documents' created with size/type restrictions",
        "RLS policies allow staff to upload and view their own attachments",
        "RLS policies allow admins to view and update attachment status"
      ],
      "passes": true
    },
    {
      "id": "F028",
      "title": "Update shared schemas for document attachments in chat",
      "type": "feature",
      "description": "Extend @medsync/shared chat.schema.ts with attachment types and validation schemas. Add ChatAttachment type with status enum (pending/accepted/rejected). Create uploadAttachmentSchema with Zod validation for file metadata. Add updateAttachmentStatusSchema for admin review actions. Update MessageWithSender type to include attachments array.",
      "acceptance_criteria": [
        "ChatAttachment type defined with all fields including status",
        "Zod schemas created for attachment upload and status update",
        "MessageWithSender extended to include optional attachments array",
        "File type validation includes PDF and common image formats (jpg, png, jpeg)",
        "File size limits defined in schema (e.g., max 10MB)"
      ],
      "passes": true
    },
    {
      "id": "F029",
      "title": "Implement file picker and upload in mobile chat",
      "type": "feature",
      "description": "Add document/image picker button to mobile chat input using expo-image-picker and expo-document-picker. Implement file selection UI with preview for images and file info for PDFs. Create upload function to Supabase storage with progress indicator. Insert attachment record in chat_attachments table linked to message. Handle upload errors with user feedback. Support selecting multiple files (up to 3 per message).",
      "acceptance_criteria": [
        "Document picker button added to chat input in mobile app",
        "Image picker integrated for selecting photos from gallery/camera",
        "PDF picker integrated for selecting document files",
        "File upload to Supabase storage with progress indicator",
        "Attachment metadata saved to chat_attachments table with message reference"
      ],
      "passes": true
    },
    {
      "id": "F030",
      "title": "Display document attachments in mobile chat messages",
      "type": "feature",
      "description": "Create AttachmentPreview component for mobile to display document attachments in chat messages. Show image thumbnails with tap-to-view fullscreen using modal. Show PDF icon with filename and size, tap to open with sharing options. Display attachment status badges (pending/accepted/rejected) with appropriate colors. Handle download and caching for offline viewing. Show rejected reason if applicable.",
      "acceptance_criteria": [
        "Image attachments display as thumbnails in message bubbles",
        "PDF attachments show file icon, name, and size",
        "Tap on image opens fullscreen viewer with zoom/pan",
        "Tap on PDF opens native document viewer or sharing sheet",
        "Status badges display correctly (pending, accepted, rejected)"
      ],
      "passes": true
    },
    {
      "id": "F031",
      "title": "Build admin document review UI in web dashboard",
      "type": "feature",
      "description": "Add attachment display section to ChatMessages component in web app. Create DocumentAttachmentCard component showing thumbnail/icon, filename, upload date, and current status. Implement review action buttons (Accept/Reject) with confirmation dialog. Add rejection reason textarea when rejecting. Update attachment status via Supabase RPC function. Show visual feedback for review actions. Filter to show only support conversations with pending attachments.",
      "acceptance_criteria": [
        "Attachments displayed in web chat messages with proper styling",
        "Accept and Reject buttons available for pending attachments",
        "Rejection dialog includes textarea for reason input",
        "Status updates persist to database and reflect in UI immediately",
        "Admin can view full-size images and download PDFs"
      ],
      "passes": true
    },
    {
      "id": "F032",
      "title": "Create push notification system for attachment status updates",
      "type": "feature",
      "description": "Extend notification.schema.ts with new types: 'document_accepted' and 'document_rejected'. Create Supabase Edge Function or database trigger to send push notifications when admin updates attachment status. Include attachment filename and conversation context in notification payload. Use existing NotificationProvider in mobile to handle incoming notifications. Route users to specific chat conversation when tapping notification.",
      "acceptance_criteria": [
        "New notification types added to schema: document_accepted, document_rejected",
        "Notifications triggered automatically when attachment status changes",
        "Push notification includes filename and actionable data",
        "Tapping notification navigates to correct chat conversation in mobile",
        "Notification stored in notifications table for history"
      ],
      "passes": true
    },
    {
      "id": "F033",
      "title": "Implement real-time updates for attachment status changes",
      "type": "feature",
      "description": "Setup Supabase realtime subscription for chat_attachments table in both mobile and web apps. Update ChatMessages components to reflect status changes instantly without refresh. Show toast/alert in mobile when attachment is reviewed. Update unread count logic to include pending attachments. Ensure optimistic updates with rollback on error.",
      "acceptance_criteria": [
        "Realtime subscription established for chat_attachments changes",
        "Status changes reflect immediately in both mobile and web UIs",
        "Toast notification shown in mobile when document is reviewed",
        "No manual refresh required to see updated statuses",
        "Handles network interruptions gracefully with reconnection"
      ],
      "passes": false
    },
    {
      "id": "F034",
      "title": "Add attachment management API endpoints and validation",
      "type": "feature",
      "description": "Create Supabase RPC functions: upload_chat_attachment, update_attachment_status, delete_attachment. Implement business logic validation (file type, size, user permissions). Add rate limiting for uploads (max 10 per hour per user). Create utility functions in mobile/web for attachment operations. Handle edge cases: storage cleanup on message deletion, orphaned attachments. Add logging for audit trail.",
      "acceptance_criteria": [
        "RPC functions created with proper error handling and validation",
        "File type and size validation enforced server-side",
        "Rate limiting prevents abuse of upload feature",
        "Orphaned attachments cleaned up automatically via scheduled job",
        "All attachment operations logged for audit purposes"
      ],
      "passes": false
    },
    {
      "id": "F035",
      "title": "Write tests for document upload and review workflow",
      "type": "feature",
      "description": "Create unit tests for attachment schemas and utility functions. Write integration tests for upload flow in mobile using Jest/Detox. Create e2e tests for admin review workflow in web using Playwright. Test file validation, storage operations, and status updates. Test push notification delivery and navigation. Verify RLS policies prevent unauthorized access.",
      "acceptance_criteria": [
        "Unit tests cover attachment schemas and validation logic",
        "Integration tests verify mobile upload flow end-to-end",
        "E2e tests verify admin can review and update attachment status",
        "Tests verify push notifications are sent and received correctly",
        "Security tests confirm RLS policies work as expected"
      ],
      "passes": false
    }
  ]
}